Autodesk.Revit.DB.Visual.AssetPropertyDistance.IsValidValue(System.Double)
Checks that the value is a valid value for this property.
value:
The value to be checked.
Returns:
True if the value is valid for the property.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot check validity for a property not being edited in AppearanceAssetEditScope.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetPropertyDistance.DisplayUnitType
Unit distance.

Autodesk.Revit.DB.Visual.AssetPropertyDistance.Value
Value of the property.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input value is invalid for this AssetPropertyDistance property.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The asset property is not editable.

Autodesk.Revit.DB.Visual.AssetPropertyDistance
Represents a property of material.